Roboy/roboy_motor_controller_code/RTE/Device/TLE9879QXA40/port.h
/*
 ***********************************************************************************************************************
 *
 * Copyright (c) 2015, Infineon Technologies AG
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,are permitted provided that the
 * following conditions are met:
 *
 *   Redistributions of source code must retain the above copyright notice, this list of conditions and the  following
 *   disclaimer.
 *
 *   Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
 *   following disclaimer in the documentation and/or other materials provided with the distribution.
 *
 *   Neither the name of the copyright holders nor the names of its contributors may be used to endorse or promote
 *   products derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT  OF THE
 * USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 **********************************************************************************************************************/
/**
 * \file     port.h
 *
 * \brief    Port/GPIO low level access library
 *
 * \version  V0.5.5
 * \date     27. Nov 2018
 *
 * \note This file violates [MISRA Rule 38], [MISRA Rule 45]
 */

/*******************************************************************************
**                      Author(s) Identity                                    **
********************************************************************************
**                                                                            **
** Initials     Name                                                          **
** ---------------------------------------------------------------------------**
** SS           Steffen Storandt                                              **
** DM           Daniel Mysliwitz                                              **
** TA           Thomas Albersinger                                            **
** JO           Julia Ott                                                     **
**                                                                            **
*******************************************************************************/

/*******************************************************************************
**                      Revision Control History                              **
*******************************************************************************/
/* 
 * V0.5.5: 2018-11-27, JO:   Doxygen update, moved revision history from port.c to port.h,
 *                           Port_Init() uses new defines at PORT_XML_VERSION >= 10303
 *                           Replaced __STATIC_INLINE by INLINE
 * V0.5.4: 2018-03-20, DM:   double slashes removed to meet MISRA 2012
 *                           Replaced macros by INLINE functions
 *                           Replaced register accesses within functions by function calls
 *                           Replaced __STATIC_INLINE by INLINE
 * V0.5.3: 2017-10-10, DM:   MISRA 2012 compliance, the following PC-Lint rules are globally deactivated:
 *                           Info 793: ANSI/ISO limit of 6 'significant characters in an external identifier
 *                           Info 835: A zero has been given as right argument to operator
 *                           Info 845: The left argument to operator '&' is certain to be 0
 *                           The following MISRA rules are deactivated locally:
 *                           Warning 572: Excessive shift value (precision 0 shifted right by 1) [MISRA Rule 38]
 * V0.5.2: 2017-02-16, DM:   Port prefix changed to capital letters
 *                           API extended
 * V0.5.1: 2015-02-10, DM:   individual header file added
 * V0.5.0: 2014-04-25, TA:   Port_Init(): use #defines from "IFX Config Wizard"
 * V0.4.0: 2013-10-16, DM:   Port Configuration changed into header file
 *                           with Configuration Wizard
 *                           configuration stored into #defines
 *                           Port_Init() modified 
 * V0.3.0: 2013-02-10, DM:   function Port_ChangePin() enhanced by Port Dir    
 *                           adjustment, ne function added PORT_ChangePinAlt() 
 *                           to set the alternative settings for a Port Pin at 
 *                           runtime                                           
 * V0.2.0: 2012-12-13, SS:   New SFR format                                    
 * V0.1.0: 2012-11-12, SS:   Initial version                                   
 */

#ifndef PORT_H
#define PORT_H

/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/
#include "tle987x.h"
#include "types.h"
#include "cmsis_misra.h"
#include "sfr_access.h"
/*******************************************************************************
**                      Global Type Definitions                               **
*******************************************************************************/
/**\brief Port indices, Port P0*/
#define PORT_P0 (0U)
/**\brief Port indices, Port P1*/
#define PORT_P1 (1U)
/**\brief Port indices, Port P2*/
#define PORT_P2 (2U)

/**\brief Port actions, clear*/
#define PORT_ACTION_CLEAR  (0U)
/**\brief Port actions, set*/
#define PORT_ACTION_SET    (1U)
/**\brief Port actions, toggle*/
#define PORT_ACTION_TOGGLE (2U)
/**\brief Port actions, input*/
#define PORT_ACTION_INPUT  (3U)
/**\brief Port actions, output*/
#define PORT_ACTION_OUTPUT (4U)

