Roboy/roboy_motor_controller_code/RTE/Device/TLE9879QXA40/port.h
/*******************************************************************************
**                      Global Inline Function Definitions                    **
*******************************************************************************/
/** \brief sets Port P00 to Output.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P00 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P00_Output_Set();
 *     PORT_P00_Output_High_Set();
 *	   PORT_P00_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P00_Output_Set(void)
{
	Field_Mod8(&PORT->P0_DIR.reg, (uint8)PORT_P0_DIR_P0_Pos, (uint8)PORT_P0_DIR_P0_Msk, 1u);
}

/** \brief sets Port P00 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P00 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P00_Input_Set();
 *     sts = PORT_P00_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P00_Input_Set(void)
{
	Field_Mod8(&PORT->P0_DIR.reg, (uint8)PORT_P0_DIR_P0_Pos, (uint8)PORT_P0_DIR_P0_Msk, 0u);
}

/** \brief sets Port P01 to Output.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P01 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P01_Output_Set();
 *     PORT_P01_Output_High_Set();
 *	   PORT_P01_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P01_Output_Set(void)
{
	Field_Mod8(&PORT->P0_DIR.reg, (uint8)PORT_P0_DIR_P1_Pos, (uint8)PORT_P0_DIR_P1_Msk, 1u);
}

/** \brief sets Port P01 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P01 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P01_Input_Set();
 *     sts = PORT_P01_Get(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P01_Input_Set(void)
{
	Field_Mod8(&PORT->P0_DIR.reg, (uint8)PORT_P0_DIR_P1_Pos, (uint8)PORT_P0_DIR_P1_Msk, 0u);
}

/** \brief sets Port P02 to Output.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P02 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P02_Output_Set();
 *     PORT_P02_Output_High_Set();
 *	   PORT_P02_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P02_Output_Set(void)
{
	Field_Mod8(&PORT->P0_DIR.reg, (uint8)PORT_P0_DIR_P2_Pos, (uint8)PORT_P0_DIR_P2_Msk, 1u);
}

/** \brief sets Port P02 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P02 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P02_Input_Set();
 *     sts = PORT_P02_Get(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P02_Input_Set(void)
{
	Field_Mod8(&PORT->P0_DIR.reg, (uint8)PORT_P0_DIR_P2_Pos, (uint8)PORT_P0_DIR_P2_Msk, 0u);
}

/** \brief sets Port P03 to Output.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P03 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P03_Output_Set();
 *     PORT_P03_Output_High_Set();
 *	   PORT_P03_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P03_Output_Set(void)
{
	Field_Mod8(&PORT->P0_DIR.reg, (uint8)PORT_P0_DIR_P3_Pos, (uint8)PORT_P0_DIR_P3_Msk, 1u);
}

/** \brief sets Port P03 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P03 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P03_Input_Set();
 *     sts = PORT_P03_Get(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P03_Input_Set(void)
{
	Field_Mod8(&PORT->P0_DIR.reg, (uint8)PORT_P0_DIR_P3_Pos, (uint8)PORT_P0_DIR_P3_Msk, 0u);
}

/** \brief sets Port P04 to Output.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P04 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P04_Output_Set();
 *     PORT_P04_Output_High_Set();
 *	   PORT_P04_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P04_Output_Set(void)
{
	Field_Mod8(&PORT->P0_DIR.reg, (uint8)PORT_P0_DIR_P4_Pos, (uint8)PORT_P0_DIR_P4_Msk, 1u);
}

/** \brief sets Port P04 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P04 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P04_Input_Set();
 *     sts = PORT_P04_Get(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P04_Input_Set(void)
{
	Field_Mod8(&PORT->P0_DIR.reg, (uint8)PORT_P0_DIR_P4_Pos, (uint8)PORT_P0_DIR_P4_Msk, 0u);
}

/** \brief sets Port P00 to High Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P00 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P00_Output_Set();
 *     PORT_P00_Output_High_Set();
 *	   PORT_P00_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P00_Output_High_Set(void)
{
	Field_Mod8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P0_Pos, (uint8)PORT_P0_DATA_P0_Msk, 1u);
}

/** \brief sets Port P00 to Low Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P00 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P00_Output_Set();
 *     PORT_P00_Output_Low_Set();
 *	   PORT_P00_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P00_Output_Low_Set(void)
{
	Field_Mod8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P0_Pos, (uint8)PORT_P0_DATA_P0_Msk, 0u);
}

/** \brief sets Port P00 to Toggle Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P00 as output, Toggle and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P00_Output_Set();
 *     PORT_P00_Output_Toggle_Set();
 *	   PORT_P00_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P00_Output_Toggle_Set(void)
{
	Field_Inv8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P0_Msk);
}

