Roboy/roboy_motor_controller_code/RTE/Device/TLE9879QXA40/port.h
/** \brief reads Port P01 Status.
 *
 * \return P01 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P01 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *  
 *     PORT_P01_Input_Set();
 *     sts = PORT_P01_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P01_Get(void)
{
	return ( u8_Field_Rd8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P1_Pos, (uint8)PORT_P0_DATA_P1_Msk) );
}

/** \brief reads Port P02 Status.
 *
 * \return P02 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P02 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P02_Input_Set();
 *     sts = PORT_P02_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P02_Get(void)
{
	return ( u8_Field_Rd8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P2_Pos, (uint8)PORT_P0_DATA_P2_Msk) );
}

/** \brief reads Port P03 Status.
 *
 * \return P03 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P03 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P03_Input_Set();
 *     sts = PORT_P03_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P03_Get(void)
{
	return ( u8_Field_Rd8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P3_Pos, (uint8)PORT_P0_DATA_P3_Msk) );
}

/** \brief reads Port P04 Status.
 *
 * \return P04 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P04 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P04_Input_Set();
 *     sts = PORT_P04_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P04_Get(void)
{
	return ( u8_Field_Rd8(&PORT->P0_DATA.reg, (uint8)PORT_P0_DATA_P4_Pos, (uint8)PORT_P0_DATA_P4_Msk) );
}

/** \brief enables Output OpenDrain for Port P00.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P00 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P00_Output_Set();
 *     PORT_P00_Output_Low_Set();
 *	   PORT_P00_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P00_OpenDrain_En(void)
{
	Field_Mod8(&PORT->P0_OD.reg, (uint8)PORT_P0_OD_P0_Pos, (uint8)PORT_P0_OD_P0_Msk, 1u);
}

/** \brief disables Output OpenDrain for Port P00.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P00 as output, Low and Normal Mode.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P00_Output_Set();
 *     PORT_P00_Output_Low_Set();
 *	   PORT_P00_OpenDrain_Dis();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P00_OpenDrain_Dis(void)
{
	Field_Mod8(&PORT->P0_OD.reg, (uint8)PORT_P0_OD_P0_Pos, (uint8)PORT_P0_OD_P0_Msk, 0u);
}

/** \brief enables Output OpenDrain for Port P01.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P01 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P01_Output_Set();
 *     PORT_P01_Output_Low_Set();
 *	   PORT_P01_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P01_OpenDrain_En(void)
{
	Field_Mod8(&PORT->P0_OD.reg, (uint8)PORT_P0_OD_P1_Pos, (uint8)PORT_P0_OD_P1_Msk, 1u);
}

/** \brief disables Output OpenDrain for Port P01.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P01 as output, Low and Normal Mode.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P01_Output_Set();
 *     PORT_P01_Output_Low_Set();
 *	   PORT_P01_OpenDrain_Dis();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P01_OpenDrain_Dis(void)
{
	Field_Mod8(&PORT->P0_OD.reg, (uint8)PORT_P0_OD_P1_Pos, (uint8)PORT_P0_OD_P1_Msk, 0u);
}

/** \brief enables Output OpenDrain for Port P02.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P02 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P02_Output_Set();
 *     PORT_P02_Output_Low_Set();
 *	   PORT_P02_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P02_OpenDrain_En(void)
{
	Field_Mod8(&PORT->P0_OD.reg, (uint8)PORT_P0_OD_P2_Pos, (uint8)PORT_P0_OD_P2_Msk, 1u);
}

/** \brief disables Output OpenDrain for Port P02.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P02 as output, Low and Normal Mode.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P02_Output_Set();
 *     PORT_P02_Output_Low_Set();
 *	   PORT_P02_OpenDrain_Dis();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P02_OpenDrain_Dis(void)
{
	Field_Mod8(&PORT->P0_OD.reg, (uint8)PORT_P0_OD_P2_Pos, (uint8)PORT_P0_OD_P2_Msk, 0u);
}

/** \brief enables Output OpenDrain for Port P03.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P03 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P03_Output_Set();
 *     PORT_P03_Output_Low_Set();
 *	   PORT_P03_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P03_OpenDrain_En(void)
{
	Field_Mod8(&PORT->P0_OD.reg, (uint8)PORT_P0_OD_P3_Pos, (uint8)PORT_P0_OD_P3_Msk, 1u);
}

/** \brief disables Output OpenDrain for Port P03.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P03 as output, Low and Normal Mode.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P03_Output_Set();
 *     PORT_P03_Output_Low_Set();
 *	   PORT_P03_OpenDrain_Dis();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P03_OpenDrain_Dis(void)
{
	Field_Mod8(&PORT->P0_OD.reg, (uint8)PORT_P0_OD_P3_Pos, (uint8)PORT_P0_OD_P3_Msk, 0u);
}

/** \brief enables Output OpenDrain for Port P04.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P04 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P04_Output_Set();
 *     PORT_P04_Output_Low_Set();
 *	   PORT_P04_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P04_OpenDrain_En(void)
{
	Field_Mod8(&PORT->P0_OD.reg, (uint8)PORT_P0_OD_P4_Pos, (uint8)PORT_P0_OD_P4_Msk, 1u);
}

/** \brief disables Output OpenDrain for Port P04.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P04 as output, Low and Normal Mode.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P04_Output_Set();
 *     PORT_P04_Output_Low_Set();
 *	   PORT_P04_OpenDrain_Dis();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P04_OpenDrain_Dis(void)
{
	Field_Mod8(&PORT->P0_OD.reg, (uint8)PORT_P0_OD_P4_Pos, (uint8)PORT_P0_OD_P4_Msk, 0u);
}

/** \brief enables PullUpDown for Port P00.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P00.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P00_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P00_PullUpDown_En(void)
{
	Field_Mod8(&PORT->P0_PUDEN.reg, (uint8)PORT_P0_PUDEN_P0_Pos, (uint8)PORT_P0_PUDEN_P0_Msk, 1u);
}

/** \brief disables PullUpDown for Port P00.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P00.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P00_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P00_PullUpDown_Dis(void)
{
	Field_Mod8(&PORT->P0_PUDEN.reg, (uint8)PORT_P0_PUDEN_P0_Pos, (uint8)PORT_P0_PUDEN_P0_Msk, 0u);
}

/** \brief enables PullUpDown for Port P01.
 *
 * \brief <b>Example</b><br>
 * \brief This example enables PullUpDown for Port P01.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P01_PullUpDown_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P01_PullUpDown_En(void)
{
	Field_Mod8(&PORT->P0_PUDEN.reg, (uint8)PORT_P0_PUDEN_P1_Pos, (uint8)PORT_P0_PUDEN_P1_Msk, 1u);
}

/** \brief disables PullUpDown for Port P01.
 *
 * \brief <b>Example</b><br>
 * \brief This example disables PullUpDown for Port P01.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P01_PullUpDown_Dis();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P01_PullUpDown_Dis(void)
{
	Field_Mod8(&PORT->P0_PUDEN.reg, (uint8)PORT_P0_PUDEN_P1_Pos, (uint8)PORT_P0_PUDEN_P1_Msk, 0u);
}

