Roboy/roboy_motor_controller_code/RTE/Device/TLE9879QXA40/port.h
/** \brief sets Port P10 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P10 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P10_Input_Set();
 *     sts = PORT_P10_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P10_Input_Set(void)
{
	Field_Mod8(&PORT->P1_DIR.reg, (uint8)PORT_P1_DIR_P0_Pos, (uint8)PORT_P1_DIR_P0_Msk, 0u);
}

/** \brief sets Port P11 to Output.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P11 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P11_Output_Set();
 *     PORT_P11_Output_High_Set();
 *	   PORT_P11_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P11_Output_Set(void)
{
	Field_Mod8(&PORT->P1_DIR.reg, (uint8)PORT_P1_DIR_P1_Pos, (uint8)PORT_P1_DIR_P1_Msk, 1u);
}

/** \brief sets Port P11 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P11 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P11_Input_Set();
 *     sts = PORT_P11_Get(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P11_Input_Set(void)
{
	Field_Mod8(&PORT->P1_DIR.reg, (uint8)PORT_P1_DIR_P1_Pos, (uint8)PORT_P1_DIR_P1_Msk, 0u);
}

/** \brief sets Port P12 to Output.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P12 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P12_Output_Set();
 *     PORT_P12_Output_High_Set();
 *	   PORT_P12_P13_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P12_Output_Set(void)
{
	Field_Mod8(&PORT->P1_DIR.reg, (uint8)PORT_P1_DIR_P2_Pos, (uint8)PORT_P1_DIR_P2_Msk, 1u);
}

/** \brief sets Port P12 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P12 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P12_Input_Set();
 *     sts = PORT_P12_Get(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P12_Input_Set(void)
{
	Field_Mod8(&PORT->P1_DIR.reg, (uint8)PORT_P1_DIR_P2_Pos, (uint8)PORT_P1_DIR_P2_Msk, 0u);
}

/** \brief sets Port P13 to Output.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P13 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P13_Output_Set();
 *     PORT_P13_Output_High_Set();
 *	   PORT_P12_P13_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P13_Output_Set(void)
{
	Field_Mod8(&PORT->P1_DIR.reg, (uint8)PORT_P1_DIR_P3_Pos, (uint8)PORT_P1_DIR_P3_Msk, 1u);
}

/** \brief sets Port P13 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P13 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P13_Input_Set();
 *     sts = PORT_P13_Get(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P13_Input_Set(void)
{
	Field_Mod8(&PORT->P1_DIR.reg, (uint8)PORT_P1_DIR_P3_Pos, (uint8)PORT_P1_DIR_P3_Msk, 0u);
}

/** \brief sets Port P14 to Output.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P14 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P14_Output_Set();
 *     PORT_P14_Output_High_Set();
 *	   PORT_P14_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P14_Output_Set(void)
{
	Field_Mod8(&PORT->P1_DIR.reg, (uint8)PORT_P1_DIR_P4_Pos, (uint8)PORT_P1_DIR_P4_Msk, 1u);
}

/** \brief sets Port P14 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P14 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P14_Input_Set();
 *     sts = PORT_P14_Get(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P14_Input_Set(void)
{
	Field_Mod8(&PORT->P1_DIR.reg, (uint8)PORT_P1_DIR_P4_Pos, (uint8)PORT_P1_DIR_P4_Msk, 0u);
}

/** \brief sets Port P10 to High Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P10 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P10_Output_Set();
 *     PORT_P10_Output_High_Set();
 *	   PORT_P10_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P10_Output_High_Set(void)
{
	Field_Mod8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P0_Pos, (uint8)PORT_P1_DATA_P0_Msk, 1u);
}

/** \brief sets Port P10 to Low Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P10 as output, Low and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P10_Output_Set();
 *     PORT_P10_Output_Low_Set();
 *	   PORT_P10_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P10_Output_Low_Set(void)
{
	Field_Mod8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P0_Pos, (uint8)PORT_P1_DATA_P0_Msk, 0u);
}

/** \brief sets Port P10 to Toggle Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P10 as output, Toggle and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P10_Output_Set();
 *     PORT_P10_Output_Toggle_Set();
 *	   PORT_P10_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P10_Output_Toggle_Set(void)
{
	Field_Inv8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P0_Msk);
}

/** \brief sets Port P11 to High Status.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P11 as output, High and Open-Drain.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P11_Output_Set();
 *     PORT_P11_Output_High_Set();
 *	   PORT_P11_OpenDrain_En();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P11_Output_High_Set(void)
{
	Field_Mod8(&PORT->P1_DATA.reg, (uint8)PORT_P1_DATA_P1_Pos, (uint8)PORT_P1_DATA_P1_Msk, 1u);
}

