Roboy/roboy_motor_controller_code/RTE/Device/TLE9879QXA40/port.h
/** \brief sets PullUp for Port P14.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullUp for Port P14.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P14_PullUpDown_En();
 *     PORT_P14_PullUp_Set(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P14_PullUp_Set(void)
{
	Field_Mod8(&PORT->P1_PUDSEL.reg, (uint8)PORT_P1_PUDSEL_P4_Pos, (uint8)PORT_P1_PUDSEL_P4_Msk, 1u);
}

/** \brief sets PullDown for Port P14.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets PullDown for Port P14.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P14_PullUpDown_En();
 *     PORT_P14_PullDown_Set(); 
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P14_PullDown_Set(void)
{
	Field_Mod8(&PORT->P1_PUDSEL.reg, (uint8)PORT_P1_PUDSEL_P4_Pos, (uint8)PORT_P1_PUDSEL_P4_Msk, 0u);
}

/** \brief sets Port P20 to Disable.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets P20 to disable.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P20_Dis();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P20_Dis(void)
{
	Field_Mod8(&PORT->P2_DIR.reg, (uint8)PORT_P2_DIR_P0_Pos, (uint8)PORT_P2_DIR_P0_Msk, 1u);
}

/** \brief sets Port P20 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P20 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P20_Input_Set();
 *     sts = PORT_P20_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P20_Input_Set(void)
{
	Field_Mod8(&PORT->P2_DIR.reg, (uint8)PORT_P2_DIR_P0_Pos, (uint8)PORT_P2_DIR_P0_Msk, 0u);
}

/** \brief sets Port P22 to Disable.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets P22 to disable.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P22_Dis();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P22_Dis(void)
{
	Field_Mod8(&PORT->P2_DIR.reg, (uint8)PORT_P2_DIR_P2_Pos, (uint8)PORT_P2_DIR_P2_Msk, 1u);
}

/** \brief sets Port P22 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P22 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P22_Input_Set();
 *     sts = PORT_P22_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P22_Input_Set(void)
{
	Field_Mod8(&PORT->P2_DIR.reg, (uint8)PORT_P2_DIR_P2_Pos, (uint8)PORT_P2_DIR_P2_Msk, 0u);
}

/** \brief sets Port P23 to Disable.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets P23 to disable.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P23_Dis();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P23_Dis(void)
{
	Field_Mod8(&PORT->P2_DIR.reg, (uint8)PORT_P2_DIR_P3_Pos, (uint8)PORT_P2_DIR_P3_Msk, 1u);
}

/** \brief sets Port P23 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P23 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P23_Input_Set();
 *     sts = PORT_P23_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P23_Input_Set(void)
{
	Field_Mod8(&PORT->P2_DIR.reg, (uint8)PORT_P2_DIR_P3_Pos, (uint8)PORT_P2_DIR_P3_Msk, 0u);
}

/** \brief sets Port P24 to Disable.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets P24 to disable.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P24_Dis();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P24_Dis(void)
{
	Field_Mod8(&PORT->P2_DIR.reg, (uint8)PORT_P2_DIR_P4_Pos, (uint8)PORT_P2_DIR_P4_Msk, 1u);
}

/** \brief sets Port P24 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P24 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P24_Input_Set();
 *     sts = PORT_P24_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P24_Input_Set(void)
{
	Field_Mod8(&PORT->P2_DIR.reg, (uint8)PORT_P2_DIR_P4_Pos, (uint8)PORT_P2_DIR_P4_Msk, 0u);
}

/** \brief sets Port P25 to Disable.
 *
 * \brief <b>Example</b><br>
 * \brief This example sets P25 to disable.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     PORT_P25_Dis();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P25_Dis(void)
{
	Field_Mod8(&PORT->P2_DIR.reg, (uint8)PORT_P2_DIR_P5_Pos, (uint8)PORT_P2_DIR_P5_Msk, 1u);
}

/** \brief sets Port P25 to Input.
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P25 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P25_Input_Set();
 *     sts = PORT_P25_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE void PORT_P25_Input_Set(void)
{
	Field_Mod8(&PORT->P2_DIR.reg, (uint8)PORT_P2_DIR_P5_Pos, (uint8)PORT_P2_DIR_P5_Msk, 0u);
}

/** \brief reads Port P20 Status.
 *
 * \return P20 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P20 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P20_Input_Set();
 *     sts = PORT_P20_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P20_Get(void)
{
	return ( u8_Field_Rd8(&PORT->P2_DATA.reg, (uint8)PORT_P2_DATA_P0_Pos, (uint8)PORT_P2_DATA_P0_Msk) );
}

/** \brief reads Port P22 Status.
 *
 * \return P22 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P22 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P22_Input_Set();
 *     sts = PORT_P22_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P22_Get(void)
{
	return ( u8_Field_Rd8(&PORT->P2_DATA.reg, (uint8)PORT_P2_DATA_P2_Pos, (uint8)PORT_P2_DATA_P2_Msk) );
}

/** \brief reads Port P23 Status.
 *
 * \return P23 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P23 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P23_Input_Set();
 *     sts = PORT_P23_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P23_Get(void)
{
	return ( u8_Field_Rd8(&PORT->P2_DATA.reg, (uint8)PORT_P2_DATA_P3_Pos, (uint8)PORT_P2_DATA_P3_Msk) );
}

/** \brief reads Port P24 Status.
 *
 * \return P24 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P24 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P24_Input_Set();
 *     sts = PORT_P24_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P24_Get(void)
{
	return ( u8_Field_Rd8(&PORT->P2_DATA.reg, (uint8)PORT_P2_DATA_P4_Pos, (uint8)PORT_P2_DATA_P4_Msk) );
}

/** \brief reads Port P25 Status.
 *
 * \return P25 Status
 *
 * \brief <b>Example</b><br>
 * \brief This example configures P25 as input and reads the status.
 * ~~~~~~~~~~~~~~~{.c}
 * void Example_Function(void)
 * {
 *     uint8 sts;
 *
 *     PORT_P25_Input_Set();
 *     sts = PORT_P25_Get();
 * }
 * ~~~~~~~~~~~~~~~ 
 * \ingroup PORT_api
 */
INLINE uint8 PORT_P25_Get(void)
{
	return ( u8_Field_Rd8(&PORT->P2_DATA.reg, (uint8)PORT_P2_DATA_P5_Pos, (uint8)PORT_P2_DATA_P5_Msk) );
}

